samples/sample-basic/android/app/atlas/mermaid/chart.mmd
graph TD
  _android_app[":android:app"]
  _android_lib[":android:lib"]
  _java[":java"]
  _kotlin_jvm[":kotlin:jvm"]
  _kotlin_kmp[":kotlin:kmp"]
  _other[":other"]
  _android_app --> _android_lib
  _android_app --> _kotlin_kmp
  _android_lib --> _kotlin_jvm
  _android_lib --> _other
  _java --> _other
  _kotlin_kmp --> _java
  _kotlin_kmp --> _kotlin_jvm
